Revit 2027 API
FillGrid.GetPointLineZone(UV) Method
 Gets the index of fill grid line closest to the input 2d point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetPointLineZone(
	UV point
)
Public Function GetPointLineZone (
	point As UV
) As Integer
public:
int GetPointLineZone(
	UV^ point
)
member GetPointLineZone :
        point : UV -> int
Parameters
point UV
 Input point.
Return Value
Int32
 The index of fill grid line.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillGrid Class
GetPointLineZone Overload
Autodesk.Revit.DB Namespace